import os
from configparser import ConfigParser

config = ConfigParser()
config.read(f"{__file__.replace('config.py', 'config.ini')}")

TOKEN = os.getenv("TG_TOKEN", config.get("TG", "TOKEN", fallback=""))

DATABASE = os.getenv("DATABASE", "tgbradminpanel")

ADMIN = [1810809634, 6931589642]

LEADERS_TIME_LEFT = 25
STRUCTURES = {
    "Главный администратор": "Администрация",
    "Заместитель ГА": "Администрация",
    "Основной ЗГА": "Администрация",
    "Куратор администрации": "Администрация",
    "Заместитель КА": "Администрация",
    "Главный за АП": "Агенты поддержки",
    "Главный за лидерами": "Лидеры",
}
FRACTIONS = (
    "Правительство",
    "ФСБ",
    "Войнская часть",
    "ГИБДД",
    "УМВД",
    "Больница",
    "СМИ",
    "ФСИН",
    "Арзамаское ОПГ",
    "Батыревское ОПГ",
    "Лыткаринское ОПГ",
)
ROLES = (
    "Главный администратор",
    "Основной ЗГА",
    "Заместитель ГА",
    "Куратор администрации",
    "Куратор агентов поддержки",
    "Куратор организации",
    "Заместитель КА",
    "Заместитель КАП",
    "Заместитель КО",
    "Старший администратор",
    "Ст. следящий агентов поддержки",
    "Ст. следящий силовых структур",
    "Ст. следящий социальных структур",
    "Ст. следящий криминальны структур",
    "Администратор",
    "Старший модератор",
    "Модератор",
    "Младший модератор",
)
SUPPORT_ROLES = ("Агент Поддержки", "Кандидат")
LEADERS_ROLES = (
    "Главный за лидерами",
    "Куратор организации",
    "Заместитель КО",
)
FORMSSHEET = "1wehuvOJS3HCkpTHufBKDwfwBwYkgYTE3QqukmHJ-kDI"
SEARCHSHEET = "15L9DT8FO-JGXtj8ITRDM4v23whlvmAFrMKtJ50MuGAY"
FORMURL = "https://docs.google.com/forms/d/14fAejzIIPsgfwnrHt8TDkwGWyV5_FKOFjD6rmb3xzlk/viewform"

COINS_SUBBUTTONS = {
    "coins_category_punishments": {
        "1.1": ("Снять устное предупреждение", 5),
        "1.2": ("Снять предупреждение", 15),
        "1.3": ("Снять выговор", 25),
        "1.4": ("Снять все наказания", 100),
    },
    "coins_category_immunities": {
        "2.1": ("Устное предупреждение", 8),
        "2.2": ("Предупреждение", 18),
        "2.3": ("Выговор", 28),
        "2.4": ("Любое первое наказание", 50),
    },
    "coins_category_currency": {
        "3.1": ("От 100 000 до 300 000", 5),
        "3.2": ("От 300 000 до 500 000", 15),
        "3.3": ("От 500 000 до 1 000 000", 30),
    },
    "coins_category_signature": {
        "4.1": ("Роспись от спец. администрации", 80),
        "4.2": ("Роспись от команды проекта", 60),
        "4.3": ("Роспись от руководство сервера", 20),
    },
    "coins_category_answers": {
        "5.1": ("От 500 до 1000 ответов", 15),
        "5.2": ("От 1000 до 2000 ответов", 30),
        "5.3": ("x2 ответов на 3 дня", 50),
        "5.4": ("Добить норматив", 5),
    },
    "coins_category_normatives": {
        "6.1": ("Специальный норматив 7 дней", 50),
        "6.2": ("Освобождение от норматива", 10),
        "6.3": ("Понижение норматива на 30 минут", 40),
        "6.4": ("Неактив 1 день", 3),
    },
    "coins_category_additional": {
        "7.1": ("Стикер-пак VK (10 голосов)", 30),
        "7.2": ("Доступ к автопарку семьи", 10),
    },
}
